packages/fluidsimfoam/fluidsimfoam-0.0.8.tar.gz/fluidsimfoam-0.0.8/tests/saved_cases/cbox/sim2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application       buoyantBoussinesqPimpleFoam;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           1000;

deltaT            1;

writeControl      runTime;

writeInterval     50;

purgeWrite        0;

writeFormat       binary;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable  true;

functions
{
    #includeFunc solverInfo
    #includeFunc streamlines
}
